[
  {
    "title": "Inception",
    "date": "2010-07-14",
    "grade": "8.1",
    "description": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
    "image": "images/Inception.jpg"
  },
  {
    "title": "The Dark Knight",
    "date": "2008-07-16",
    "grade": "8.3",
    "description": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker.",
    "image": "images/The Dark Knight.jpg"
  },
  {
    "title": "Avatar",
    "date": "2009-12-10",
    "grade": "7.2",
    "description": "In the 22nd century, a paraplegic Marine is dispatched to the moon Pandora on a unique mission, but becomes torn between following orders and protecting an alien civilization.",
    "image": "images/Avatar.jpg"
  },
  {
    "title": "The Avengers",
    "date": "2012-04-25",
    "grade": "7.4",
    "description": "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
    "image": "images/The Avengers.jpg"
  },
  {
    "title": "Deadpool",
    "date": "2016-02-09",
    "grade": "7.4",
    "description": "Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.",
    "image": "images/Deadpool.jpg"
  },
  {
    "title": "Interstellar",
    "date": "2014-11-05",
    "grade": "8.1",
    "description": "Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.",
    "image": "images/Interstellar.jpg"
  },
  {
    "title": "Django Unchained",
    "date": "2012-12-25",
    "grade": "7.8",
    "description": "With the help of a German bounty hunter, a freed slave sets out to rescue his wife from a brutal Mississippi plantation owner.",
    "image": "images/Django Unchained.jpg"
  },
  {
    "title": "Guardians of the Galaxy",
    "date": "2014-07-30",
    "grade": "7.9",
    "description": "Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.",
    "image": "images/Guardians of the Galaxy.jpg"
  },
  {
    "title": "Fight Club",
    "date": "1999-10-15",
    "grade": "8.3",
    "description": "A ticking-time-bomb insomniac and a slippery soap salesman channel primal male aggression into a shocking new form of therapy. Their concept catches on, with underground \"fight clubs\" forming in every town, until an eccentric gets in the way and ignites an out-of-control spiral toward oblivion.",
    "image": "images/Fight Club.jpg"
  },
  {
    "title": "Mad Max: Fury Road",
    "date": "2015-05-13",
    "grade": "7.3",
    "description": "An apocalyptic story set in the furthest reaches of our planet, in a stark desert landscape where humanity is broken, and most everyone is crazed fighting for the necessities of life. Within this world exist two rebels on the run who just might be able to restore order. There's Max, a man of action and a man of few words, who seeks peace of mind following the loss of his wife and child in the aftermath of the chaos. And Furiosa, a woman of action and a woman who believes her path to survival may be achieved if she can make it across the desert back to her childhood homeland.",
    "image": "images/Mad Max - Fury Road.jpg"
  },
  {
    "title": "The Dark Knight Rises",
    "date": "2012-07-16",
    "grade": "7.6",
    "description": "Following the death of District Attorney Harvey Dent, Batman assumes responsibility for Dent's crimes to protect the late attorney's reputation and is subsequently hunted by the Gotham City Police Department. Eight years later, Batman encounters the mysterious Selina Kyle and the villainous Bane, a new terrorist leader who overwhelms Gotham's finest. The Dark Knight resurfaces to protect a city that has branded him an enemy.",
    "image": "images/The Dark Knight Rises.jpg"
  },
  {
    "title": "The Matrix",
    "date": "1999-03-30",
    "grade": "7.9",
    "description": "Set in the 22nd century, The Matrix tells the story of a computer hacker who joins a group of underground insurgents fighting the vast and powerful computers who now rule the earth.",
    "image": "images/The Matrix.jpg"
  },
  {
    "title": "Iron Man",
    "date": "2008-04-30",
    "grade": "7.4",
    "description": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
    "image": "images/Iron Man.jpg"
  },
  {
    "title": "The Lord of the Rings: The Fellowship of the Ring",
    "date": "2001-12-18",
    "grade": "8.0",
    "description": "Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.",
    "image": "images/The Lord of the Rings - The Fellowship of the Ring.jpg"
  },
  {
    "title": "Pulp Fiction",
    "date": "1994-09-10",
    "grade": "8.3",
    "description": "A burger-loving hit man, his philosophical partner, a drug-addled gangster's moll and a washed-up boxer converge in this sprawling, comedic crime caper. Their adventures unfurl in three stories that ingeniously trip back and forth in time.",
    "image": "images/Pulp Fiction.jpg"
  },
  {
    "title": "The Hobbit: An Unexpected Journey",
    "date": "2012-11-26",
    "grade": "7.0",
    "description": "Bilbo Baggins, a hobbit enjoying his quiet life, is swept into an epic quest by Gandalf the Grey and thirteen dwarves who seek to reclaim their mountain home from Smaug, the dragon.",
    "image": "images/The Hobbit - An Unexpected Journey.jpg"
  },
  {
    "title": "The Shawshank Redemption",
    "date": "1994-09-23",
    "grade": "8.5",
    "description": "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
    "image": "images/The Shawshank Redemption.jpg"
  },
  {
    "title": "The Lord of the Rings: The Return of the King",
    "date": "2003-12-01",
    "grade": "8.1",
    "description": "Aragorn is revealed as the heir to the ancient kings as he, Gandalf and the other members of the broken fellowship struggle to save Gondor from Sauron's forces. Meanwhile, Frodo and Sam bring the ring closer to the heart of Mordor, the dark lord's realm.",
    "image": "images/The Lord of the Rings - The Return of the King.jpg"
  },
  {
    "title": "Forrest Gump",
    "date": "1994-07-06",
    "grade": "8.2",
    "description": "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. 'Forrest Gump' is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.",
    "image": "images/Forrest Gump.jpg"
  },
  {
    "title": "Star Wars: The Force Awakens",
    "date": "2015-12-15",
    "grade": "7.5",
    "description": "Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.",
    "image": "images/Star Wars - The Force Awakens.jpg"
  },
  {
    "title": "Titanic",
    "date": "1997-11-18",
    "grade": "7.5",
    "description": "84 years later, a 101-year-old woman named Rose DeWitt Bukater tells the story to her granddaughter Lizzy Calvert, Brock Lovett, Lewis Bodine, Bobby Buell and Anatoly Mikailavich on the Keldysh about her life set in April 10th 1912, on a ship called Titanic when young Rose boards the departing ship with the upper-class passengers and her mother, Ruth DeWitt Bukater, and her fiancé, Caledon Hockley. Meanwhile, a drifter and artist named Jack Dawson and his best friend Fabrizio De Rossi win third-class tickets to the ship in a game. And she explains the whole story from departure until the death of Titanic on its first and last voyage April 15th, 1912 at 2:20 in the morning.",
    "image": "images/Titanic.jpg"
  },
  {
    "title": "The Lord of the Rings: The Two Towers",
    "date": "2002-12-18",
    "grade": "8.0",
    "description": "Frodo and Sam are trekking to Mordor to destroy the One Ring of Power while Gimli, Legolas and Aragorn search for the orc-captured Merry and Pippin. All along, nefarious wizard Saruman awaits the Fellowship members at the Orthanc Tower in Isengard.",
    "image": "images/The Lord of the Rings - The Two Towers.jpg"
  },
  {
    "title": "Batman Begins",
    "date": "2005-06-10",
    "grade": "7.5",
    "description": "Driven by tragedy, billionaire Bruce Wayne dedicates his life to uncovering and defeating the corruption that plagues his home, Gotham City.  Unable to work within the system, he instead creates a new identity, a symbol of fear for the criminal underworld - The Batman.",
    "image": "images/Batman Begins.jpg"
  },
  {
    "title": "Captain America: Civil War",
    "date": "2016-04-27",
    "grade": "7.1",
    "description": "Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.",
    "image": "images/Captain America - Civil War.jpg"
  },
  {
    "title": "The Martian",
    "date": "2015-09-30",
    "grade": "7.6",
    "description": "During a manned mission to Mars, Astronaut Mark Watney is presumed dead after a fierce storm and left behind by his crew. But Watney has survived and finds himself stranded and alone on the hostile planet. With only meager supplies, he must draw upon his ingenuity, wit and spirit to subsist and find a way to signal to Earth that he is alive.",
    "image": "images/The Martian.jpg"
  },
  {
    "title": "Pirates of the Caribbean: The Curse of the Black Pearl",
    "date": "2003-07-09",
    "grade": "7.5",
    "description": "Jack Sparrow, a freewheeling 17th-century pirate who roams the Caribbean Sea, butts heads with a rival pirate bent on pillaging the village of Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her. But their seafaring mission is hardly simple.",
    "image": "images/Pirates of the Caribbean - The Curse of the Black Pearl.jpg"
  },
  {
    "title": "Harry Potter and the Philosopher's Stone",
    "date": "2001-11-16",
    "grade": "7.5",
    "description": "Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths -- and about the villain who's to blame.",
    "image": "images/Harry Potter and the Philosopher's Stone.jpg"
  },
  {
    "title": "Up",
    "date": "2009-05-13",
    "grade": "7.8",
    "description": "Carl Fredricksen spent his entire life dreaming of exploring the globe and experiencing life to its fullest. But at age 78, life seems to have passed him by, until a twist of fate (and a persistent 8-year old Wilderness Explorer named Russell) gives him a new lease on life.",
    "image": "images/Up.jpg"
  },
  {
    "title": "Avengers: Age of Ultron",
    "date": "2015-04-22",
    "grade": "7.3",
    "description": "When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.",
    "image": "images/Avengers - Age of Ultron.jpg"
  },
  {
    "title": "Star Wars",
    "date": "1977-05-25",
    "grade": "8.1",
    "description": "Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.",
    "image": "images/Star Wars.jpg"
  }
]